In [ ]:
Merge two data frames using the following condition

Create two data frames using the following two Dicts, Merge two data frames, and append the 
second data frame as a new column to the first data frame.

In [1]:
import pandas as pd

In [11]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
Car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [12]:
df1 = pd.DataFrame(Car_Price)
df1

  Company   Price
0  Toyota   23845
1   Honda   17995
2     BMV  135925
3    Audi   71400

In [14]:
df2 = pd.DataFrame(Car_Horsepower)
df2

  Company  horsepower
0  Toyota         141
1   Honda          80
2     BMV         182
3    Audi         160

In [17]:
df3 = pd.merge(df1, df2, on="Company", how="left")
df3

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160